Revit 2026 API

# RailingGetMultistoryStairsPlacementLevels Method

---

Gets the ids of the base levels of the stairs upon which this railing is placed.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ISet<ElementId> GetMultistoryStairsPlacementLevels()
```
```vb
Public Function GetMultistoryStairsPlacementLevels As ISet(Of ElementId)
```
```cpp
public:
ISet<ElementId^>^ GetMultistoryStairsPlacementLevels()
```
```fsharp
member GetMultistoryStairsPlacementLevels : unit -> ISet<ElementId>
```

#### Return Value

ISetElementId The ids of levels the railing is placed on. The returned set consists of a subset of the base level ids of the corresponding stairs in the MultistoryStairs.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The railing is not hosted by stairs in MultistoryStairs. |

The method is valid only for railings hosted by stairs in MultistoryStairs.

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace